Revit 2024 API
FaceWall Class
 A wall attached to a non-vertical massing face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class FaceWall : HostObject
Visual Basic
Public Class FaceWall _
	Inherits HostObject
Visual C++
public ref class FaceWall : public HostObject
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.FaceWall
See Also
FaceWall Members
Autodesk.Revit.DB Namespace